"""
    2.1 Переменные. Типы
"""

a = b = 2               # Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции. 

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому 

print("b = " + "str(b)") 


hello = 'Привет'    # Исправлена опечатка

print("hello = " + str(hello))  # Исправлена опечатка

# Переопределите значение переменной hello
hello = 'Jambo!'

print("hello = " + str(hello)) 

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел 

song = 'No Woman, No Cry'
defis = '-'
author = 'Bob Marley'
year = '1999'

print(song, defis, author, year)